In [3]:
import pandas as pd
from sklearn.preprocessing import StandardScaler, OneHotEncoder

# Sample data
df = pd.DataFrame({
    'Age': [25, 30, 22],
    'Salary': [50000, 60000, 52000],
    'City': ['Mumbai', 'Bangalore', 'Delhi']
})

# Scale numeric features
scaler = StandardScaler()
numeric_scaled = scaler.fit_transform(df[['Age', 'Salary']])

# Encode categorical features
encoder = OneHotEncoder(sparse_output=False)
categorical_encoded = encoder.fit_transform(df[['City']])

# Combine manually
import numpy as np
final_data = np.hstack((numeric_scaled, categorical_encoded))

In [11]:
numeric_scaled=pd.DataFrame(numeric_scaled)

In [15]:
numeric_scaled.head()

          0        1
0 -0.202031 -0.92582
1  1.313198  1.38873
2 -1.111168 -0.46291

In [17]:
categorical_encoded=pd.DataFrame(categorical_encoded)

In [19]:
categorical_encoded

     0    1    2
0  0.0  0.0  1.0
1  1.0  0.0  0.0
2  0.0  1.0  0.0

In [21]:
df

   Age  Salary       City
0   25   50000     Mumbai
1   30   60000  Bangalore
2   22   52000      Delhi

In [30]:
final_data=pd.DataFrame(final_data)

In [32]:
final_data

          0        1    2    3    4
0 -0.202031 -0.92582  0.0  0.0  1.0
1  1.313198  1.38873  1.0  0.0  0.0
2 -1.111168 -0.46291  0.0  1.0  0.0

## With ColumnTransformer (Automatic + Safe)

In [24]:
from sklearn.compose import ColumnTransformer
from sklearn.preprocessing import StandardScaler, OneHotEncoder

column_trans = ColumnTransformer(
    transformers=[
        ('num', StandardScaler(), ['Age', 'Salary']),
        ('cat', OneHotEncoder(), ['City'])
    ]
)
transformed = column_trans.fit_transform(df)